In [1]:
import pandas as pd
import sqlite3

In [2]:
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
);"""

con = sqlite3.connect('exemplos/mydata.sqllite')
con.execute(query)
con.commit()

In [4]:
data = [('Atlanta', 'Georgia', 1.25, 6), 
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'Califorinia', 1.7, 5)]

stmt = "INSERT INTO test VALUES(?,?,?,?)"
con.executemany(stmt, data)

In [5]:
con.commit()
cursor = con.execute('select * from test')
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'Califorinia', 1.7, 5)]

In [6]:
pd.DataFrame(rows, columns=[x[0]for x in cursor.description])

             a            b     c  d
0      Atlanta      Georgia  1.25  6
1  Tallahassee      Florida  2.60  3
2   Sacramento  Califorinia  1.70  5